[
  {
    "post": {
      "title": "Honduran Asylum Seeker in the Carolinas seeking resources against Racism, legal aid, any suggestions? Pls don't suggest ICE",
      "author": "DINGEE-DINGO",
      "subreddit": "ImmigrationUS",
      "text": "",
      "media": null,
      "media_url": null,
      "media_type": null,
      "original_url": "/r/ImmigrationUS/comments/eupi73/honduran_asylum_seeker_in_the_carolinas_seeking/",
      "created_utc": 1580139548.0,
      "id": "eupi73",
      "sentiment": "Neutral",
      "confidence": 0.893254816532135
    },
    "comments": [
      {
        "author": "tvtoo",
        "body": "\nhttps://cliniclegal.org/find-legal-help/affiliates/directory     \nhttps://www.immigrationadvocates.org/nonprofit/legaldirectory/    \nhttps://www.justice.gov/eoir/list-pro-bono-legal-service-providers",
        "created_utc": 1580253734.0,
        "id": "ffv1tmr",
        "parent_id": "t3_eupi73",
        "replies": [],
        "sentiment": "Neutral",
        "confidence": 0.6132808923721313
      }
    ],
    "scraped_at": "2026-02-11T22:24:36.922450"
  },
  {
    "post": {
      "title": "Traveling to Florida with Undocumented Friends",
      "author": "lanadjb",
      "subreddit": "ImmigrationUS",
      "text": "In July I will be driving from Houston, TX to Orlando, FL. I will be one of the persons that will be driving over there but I have heard that there is immigration or ICE agents on the road to Florida. I am debating on going because I am afraid that I will get pulled over and my friends will get arrested and deported or I will get in trouble for driving with undocumented immigrants. What risks do I run and is this even possible?",
      "media": null,
      "media_url": null,
      "media_type": null,
      "original_url": "/r/ImmigrationUS/comments/bw3egc/traveling_to_florida_with_undocumented_friends/",
      "created_utc": 1559515847.0,
      "id": "bw3egc",
      "sentiment": "Neutral",
      "confidence": 0.6389063596725464,
      "text_sentiment": "Neutral",
      "text_confidence": 0.8100638389587402
    },
    "comments": [
      {
        "author": "Coolnuggetts",
        "body": "Did you ever travel?",
        "created_utc": 1640235447.0,
        "id": "hpnbebq",
        "parent_id": "t3_bw3egc",
        "replies": [],
        "sentiment": "Neutral",
        "confidence": 0.8342676758766174
      }
    ],
    "scraped_at": "2026-02-11T22:29:02.064700"
  },
  {
    "post": {
      "title": "You Can’t Make This Stuff Up: Evicted ICE Protesters Left Behind Physical Wall",
      "author": "jblightner58",
      "subreddit": "ImmigrationUS",
      "text": "You Can’t Make This Stuff Up: Evicted ICE Protesters Left Behind Physical Wall\n\nJULY 29, 2018\n\nWalls are bad things, according to anti-Immigration and Customs Enforcement protesters. Unless it’s one that protects them. Then it’s all good.\n\nThat’s at least the lesson from Occupy ICE PDX, the Portland, Oregon, group that was evicted last week from the camp it set up in the hipster capital of the Pacific Northwest.\n\nThere were plenty of outrages to catalog from the Occupy ICE PDX camp, particularly the fact that it was labeled a biohazard due to the fetid nature of the trash that these protesters left behind. (I’m sure they’re going to go on to plenty of environmental protests, too.\n\nHowever, MRC TV noted what might be the most hypocritical one of all: The group’s decision to build a wall to keep police out.\n\n“Left-wing protesters in Portland finally got booted from outside the city’s immigration headquarters after holding up for five weeks and throwing a hissy fit about immigration,” host Brittany Hughes said in an episode of MRC’s “Reality Check” posted on Thursday.\n\n“And get this — guess what they did the minute the cops started trying to evict them? They built a wall.”\n\nThat was hardly the only outrage. Oh, no.\n\n“After five weeks of putting up with this particular liberal temper tantrum, the city of Portland finally wised up and gave the boot to a bunch of pro-illegal alien protesters who’d set up camp outside of a local ICE building in mid-June,” Hughes said.\n\n“This is the same über-progressive group that got caught hurling racial slurs at federal cops. One black police officer said that he had been called the n-word, an ‘Uncle Tom’ and a ‘blood traitor.’ A female Hispanic cop reported being called racist names and labeled a ‘weak woman.’ So much for loving Latinos, right? Other officers said that protesters called them rapists, murderers and Nazis and said that they hope their families die.”\n\nAs for the barrier, “when federal police finally showed up to evict the mob from federal property, protesters built a wall around their encampment to protect their group and keep out people they didn’t like.\n\n“Now, let me say that again for those who are just a little slower on the uptake,” Hughes continued.\n\n“A group of anti-border toddlers who throw a hissy fit any time someone mentions enforcing our immigration laws actually built a physical wall around their little area to defend themselves and keep out unwanted visitors. It was a crappy one made out of, like, tarps and furniture and random junk, but still, if that is not just the very definition of irony.”\n\nAlas for the demonstrators, unlike Donald Trump’s projected “big, beautiful wall,” the occupiers clearly didn’t have the resources to keep the police out indefinitely. They also apparently didn’t have the resources to clean up after themselves like adults.\n\nHughes notes that the protesters “left behind piles of garbage, dirty mattresses, used clothing, and homemade porta-potties. When they finally got inside, police found nails, dirty needles and feces.”\n\nOf course, there’s another great irony of this whole thing: The squalor these individuals were living in made ICE detention look like the Ritz-Carlton.\n\n“It was pretty disgusting, that that’s how they were living back there,” resident Frank Savage told local television in the wake of the raid. “Getting tired of waking up to the bullhorn and the sounds and the cussing.”\n\nThis is no doubt not the last time we’ll hear from Occupy ICE PDX, because these groups never really go away.\n\nHowever, at least next time, we’ll be aware of the fact that — as Ms. Hughes so eloquently put it — they’re “left-wing hypocrites who parade around calling people racist names and leaving behind piles of their own waste.”\n\nForget a wall to protect them from police — how about a wall to protect us from them?\n\nAt least they’ve proven one thing during their noxious five-week encampment: They believe that walls work, too.\n\nFacebook has greatly reduced the distribution of our stories in our readers' newsfeeds and is instead promoting mainstream media sources. When you share to your friends, however, you greatly help distribute our content. Please take a moment and consider sharing this article with your friends and family. Thank you.\n\nShare",
      "media": null,
      "media_url": null,
      "media_type": null,
      "original_url": "/r/ImmigrationUS/comments/931b5u/you_cant_make_this_stuff_up_evicted_ice/",
      "created_utc": 1532927632.0,
      "id": "931b5u",
      "sentiment": "Neutral",
      "confidence": 0.4624391496181488,
      "text_sentiment": "Negative",
      "text_confidence": 0.5467692613601685
    },
    "comments": [],
    "scraped_at": "2026-02-11T22:32:42.917054"
  },
  {
    "post": {
      "title": "ICE arrests 22 in Chicago area during 3-day operation targeting criminal aliens and immigration fugitives",
      "author": "bfwilley",
      "subreddit": "ImmigrationUS",
      "text": "",
      "media": "[Link] https://www.ice.gov/news/releases/ice-arrests-22-chicago-area-during-3-day-operation-targeting-criminal-aliens-and",
      "media_url": "https://www.ice.gov/news/releases/ice-arrests-22-chicago-area-during-3-day-operation-targeting-criminal-aliens-and",
      "media_type": "link",
      "original_url": "/r/ImmigrationUS/comments/7pju4d/ice_arrests_22_in_chicago_area_during_3day/",
      "created_utc": 1515627675.0,
      "id": "7pju4d",
      "sentiment": "Neutral",
      "confidence": 0.9196196794509888
    },
    "comments": [],
    "scraped_at": "2026-02-11T22:34:53.220505"
  }
]